app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("title", "body", "tags", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Lorem"], ["body", "Lorem ipsum dolor"], ["tags", "fgh3"], ["user_id", 12], ["created_at", "2023-11-24 10:22:56.219204"], ["updated_at", "2023-11-24 10:22:56.219204"]]
---
        def create
            puts "Current User: #{current_user.inspect}"
          @post = current_user.posts.build(post_params)

          if @post.save

UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "Lorem ipsum yarab2"], ["updated_at", "2023-11-24 12:57:10.567415"], ["id", 2]]
---
        def update
          authorize! :update, @post
          puts "Current User: #{current_user.inspect}"
          unless current_user == @post.user
            render json: { error: "You don't have permission to update this post." }, status: :forbidden
            return
          end

          if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
        def destroy
          authorize! :update, @post
          unless current_user == @post.user
            render json: { error: "You don't have permission to delete this post." }, status: :forbidden
            return
          end

          @post.destroy